In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df1 = pd.DataFrame({
    'index': [1, 2, 3, 4],
    'name': ['Корвo', 'Эмили', 'Бойл', 'Джесамина']
})

df2 = pd.DataFrame({
    'index': [1, 2, 3, 4],
    'name': ["Корво", "Бил", "Бойл", "Джесамина"]
})

In [3]:
df1

   index       name
0      1      Корвo
1      2      Эмили
2      3       Бойл
3      4  Джесамина

In [4]:
df2

   index       name
0      1      Корво
1      2        Бил
2      3       Бойл
3      4  Джесамина

In [5]:
pd.concat([df1, df2], axis=1)

   index       name  index       name
0      1      Корвo      1      Корво
1      2      Эмили      2        Бил
2      3       Бойл      3       Бойл
3      4  Джесамина      4  Джесамина

In [6]:
pd.concat([df1, df2], ignore_index=True)

   index       name
0      1      Корвo
1      2      Эмили
2      3       Бойл
3      4  Джесамина
4      1      Корво
5      2        Бил
6      3       Бойл
7      4  Джесамина

In [5]:
df1.merge(df2, on=['index', 'name'])

   index       name
0      3       Бойл
1      4  Джесамина

In [8]:
df1.merge(df2, how='inner', on='index', suffixes=('_df1', '_df2'))

   index   name_df1   name_df2
0      1      Корвo      Корво
1      2      Эмили        Бил
2      3       Бойл       Бойл
3      4  Джесамина  Джесамина

In [11]:
df1.merge(df2, how='left', on='name', suffixes=('_df1', '_df2'))

   index_df1       name  index_df2
0          1      Корвo        NaN
1          2      Эмили        NaN
2          3       Бойл        3.0
3          4  Джесамина        4.0

In [12]:
df2['name'].replace({'Корво': "Что-то"})

0       Что-то
1          Бил
2         Бойл
3    Джесамина
Name: name, dtype: object